{
  "D": 1024,
  "D_ff": 3072,
  "D_key": 128,
  "D_value": 128,
  "K": 12,
  "N": 8,
  "architectures": [
    "NeuronSparkForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_neuronspark.NeuronSparkConfig",
    "AutoModelForCausalLM": "modeling_neuronspark.NeuronSparkForCausalLM"
  },
  "bos_token_id": 1,
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "memory_layer_interval": 4,
  "model_type": "neuronspark",
  "num_layers": 24,
  "transformers_version": "5.3.0",
  "v_th_min": 0.1,
  "vocab_size": 64002
}
