{
  "metadata": {
    "total_parameters": 1159160576,
    "total_size": 2318321152
  },
  "weight_map": {
    "snn.decode_proj.weight": "model-00001-of-00002.safetensors",
    "snn.embed_tokens.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.0.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.0.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.0.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.0.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.1.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.1.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.1.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.1.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.10.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.10.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.10.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.10.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.attn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.attn_out_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.attn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.11.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.11.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.11.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.11.qkv_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.11.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.12.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.12.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.12.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.12.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.13.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.13.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.13.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.13.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.14.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.14.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.14.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.14.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.14.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.14.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.attn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.attn_out_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.attn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.15.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.15.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.15.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.15.qkv_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.15.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.block_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.block_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.block_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.input_neuron1.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.16.input_neuron1.w": "model-00002-of-00002.safetensors",
    "snn.layers.16.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.16.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_alpha_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_beta_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_gate.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.16.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.block_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.block_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.block_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.input_neuron1.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.17.input_neuron1.w": "model-00002-of-00002.safetensors",
    "snn.layers.17.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.17.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_alpha_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_beta_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_gate.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.17.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.block_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.block_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.block_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.input_neuron1.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.18.input_neuron1.w": "model-00002-of-00002.safetensors",
    "snn.layers.18.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.18.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_alpha_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_beta_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_gate.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.18.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.attn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.attn_out_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.attn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.19.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.19.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.19.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.19.qkv_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.19.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.2.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.2.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.2.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.2.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.2.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.20.block_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.block_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.block_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.input_neuron1.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.20.input_neuron1.w": "model-00002-of-00002.safetensors",
    "snn.layers.20.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.20.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_alpha_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_beta_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_gate.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.20.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.block_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.block_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.block_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.input_neuron1.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.21.input_neuron1.w": "model-00002-of-00002.safetensors",
    "snn.layers.21.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.21.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_alpha_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_beta_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_gate.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.21.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.block_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.block_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.block_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.input_neuron1.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.22.input_neuron1.w": "model-00002-of-00002.safetensors",
    "snn.layers.22.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.22.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_alpha_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_beta_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_gate.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_in.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_out.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_skip.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.W_th_x.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.b_alpha": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.b_beta": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.b_th": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_block.conv1d.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.22.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.attn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.attn_out_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.attn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.ffn_halt.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.ffn_norm.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.ffn_out_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.23.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.23.input_neuron2.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.23.input_neuron2.w": "model-00002-of-00002.safetensors",
    "snn.layers.23.qkv_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.down_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.gate_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.gate_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.gate_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.skip_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.up_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.up_neuron.w": "model-00002-of-00002.safetensors",
    "snn.layers.23.snn_ffn.up_proj.weight": "model-00002-of-00002.safetensors",
    "snn.layers.3.attn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.attn_out_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.attn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.3.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.3.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.3.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.3.qkv_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.3.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.4.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.4.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.4.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.4.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.5.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.5.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.5.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.5.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.6.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.6.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.6.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.6.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.attn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.attn_out_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.attn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.7.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.7.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.7.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.7.qkv_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.7.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.8.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.8.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.8.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.8.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.block_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.block_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.block_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.ffn_halt.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.ffn_norm.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.ffn_out_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.input_neuron1.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.9.input_neuron1.w": "model-00001-of-00002.safetensors",
    "snn.layers.9.input_neuron2.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.9.input_neuron2.w": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_alpha_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_beta_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_gate.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_in.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_out.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_skip.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.W_th_x.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.b_alpha": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.b_beta": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.b_th": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_block.conv1d.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.down_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.gate_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.gate_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.gate_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.skip_proj.weight": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.up_neuron.v_th": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.up_neuron.w": "model-00001-of-00002.safetensors",
    "snn.layers.9.snn_ffn.up_proj.weight": "model-00001-of-00002.safetensors",
    "snn.norm.gain": "model-00002-of-00002.safetensors",
    "snn.output_neuron.v_th": "model-00002-of-00002.safetensors",
    "snn.output_neuron.w": "model-00002-of-00002.safetensors",
    "snn.output_norm.weight": "model-00002-of-00002.safetensors"
  }
}
