{
  "backend": "tokenizers",
  "bos_token": "<s>",
  "eos_token": "</s>",
  "additional_special_tokens": [
    "<|thinking|>",
    "<|/thinking|>"
  ],
  "is_local": true,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<|pad|>",
  "tokenizer_class": "PreTrainedTokenizerFast",
  "unk_token": "<unk>"
}
